[
  {
    "content": "how do you validate an idea without accidentally building the whole thing? [i will not promote]\ni keep telling myself “validate first” and then somehow i’m designing landing pages, setting up payments, and writing copy before talking to a single real user 🤡 currently in india for my tetr programme, brainstorming my next idea (college makes us launch stuff), and trying not to repeat this mistake again.\n\nwhat’s your actual validation process before you commit time/money?",
    "author_name": "Historical-Ebb-4745",
    "author_profile_link": "https://www.reddit.com/user/Historical-Ebb-4745",
    "post_url": "https://www.reddit.com/r/startups/comments/1q5fmjm/how_do_you_validate_an_idea_without_accidentally/",
    "subreddit": "startups",
    "keyword_matched": "validating an idea",
    "scraped_at": "2026-02-18T00:43:18Z"
  },
  {
    "content": "How do you get your first waitlist users when you only have an idea product(validated ) i will not promote?\nHey everyone,\n\nI’ve been working on a startup idea for about 3 years now. It’s a **SaaS** that helps people build websites and apps more easily.\n\nRight now, I have:\n\n* An idea\n* A partially working product\n* A homepage (tfkity.com)\n\nI’m planning to launch in **Q1 or Q2 of 2026**, but my main problem is this:\n\nI have **no waitlist, no users, no audience**.\n\nI’m not sure how to promote my startup in a real way that actually brings early users instead of just views. I don’t know how to find the *first people* who would care enough to sign up and give feedback.\n\nFor those of you who’ve launched before:\n\n* How did you get your **first waitlist users**?\n* What would you do if you were starting from zero today?\n* Should I focus on building more, or talking to people first?\n\nAny advice would really help. Thanks",
    "author_name": "cqani290angoo",
    "author_profile_link": "https://www.reddit.com/user/cqani290angoo",
    "post_url": "https://www.reddit.com/r/startups/comments/1pvzym9/how_do_you_get_your_first_waitlist_users_when_you/",
    "subreddit": "startups",
    "keyword_matched": "validating an idea",
    "scraped_at": "2026-02-18T00:43:18Z"
  },
  {
    "content": "What's your go-to process for validating an idea early on? [i will not promote]\nHi y'all, wanted to ask and just kinda curious, what’s your process/flow to reach out to potential customers and gather user feedback? For example, I'm trying to validate an idea or understand more about a problem space and am curious what's the best way to go about this. Is it just cold outreach to potential folks on LinkedIn or do y'all have a better way of gathering that feedback?",
    "author_name": "Rokingadi",
    "author_profile_link": "https://www.reddit.com/user/Rokingadi",
    "post_url": "https://www.reddit.com/r/startups/comments/1r5nehe/whats_your_goto_process_for_validating_an_idea/",
    "subreddit": "startups",
    "keyword_matched": "validating an idea",
    "scraped_at": "2026-02-18T00:43:18Z"
  },
  {
    "content": "How do you validate an app / saas idea? I will not promote\nWhats your step by step process to validate an idea? And where can you find ideas?\n\nIve been struggling with motivation thinking that an app will not work out because the idea is stupid.\n\nAlso where can i get inspiration for new app ideas? I see people building apps but its like all apps are copied from each other.",
    "author_name": "JealousSpeaker5398",
    "author_profile_link": "https://www.reddit.com/user/JealousSpeaker5398",
    "post_url": "https://www.reddit.com/r/startups/comments/1pw95d6/how_do_you_validate_an_app_saas_idea_i_will_not/",
    "subreddit": "startups",
    "keyword_matched": "validating an idea",
    "scraped_at": "2026-02-18T00:43:18Z"
  },
  {
    "content": "Struggling to Validate an Idea and Could Use Advice. I will not promote\nI’m trying to solve a problem I personally face: verifying resumes and spotting inflated work experience or fake education. It’s time-consuming and frustrating, and I feel like other recruiters or hiring managers might have the same issue.\n\nThe problem is, I’m hitting a wall trying to validate the idea. Google Ads barely shows any search volume for related keywords, so I can’t tell if there’s real demand. At the same time, I don’t feel it’s appropriate to promote the idea in relevant subreddits, so reaching people organically is tricky.\n\nI genuinely want to understand if this is a real problem for others and figure out the best way to validate it without building a full product first.\n\nIf anyone has experience validating B2B tools in a low-search-volume space, or ideas for reaching the right audience, I’d really appreciate any advice.",
    "author_name": "Funny-Safety-6202",
    "author_profile_link": "https://www.reddit.com/user/Funny-Safety-6202",
    "post_url": "https://www.reddit.com/r/startups/comments/1nc3xez/struggling_to_validate_an_idea_and_could_use/",
    "subreddit": "startups",
    "keyword_matched": "validating an idea",
    "scraped_at": "2026-02-18T00:43:18Z"
  },
  {
    "content": "Trying to validate an idea in the gym space, early signs look good but I don’t want to get ahead of myself (I WILL NOT PROMOTE)\nSo quick backstory, I’m in consulting full time but I picked up some PT hours at my gym just to get out from behind the laptop. While doing that I kept noticing something kinda odd… a lot of members at my gym don't have any idea who the trainers are or what any of us do. I kept getting the same questions over and over. “Do you do boxing?” “Who does mornings?” “Wait you personal train people too?”\n\nOut of curiosity I asked a few gyms nearby and they all basically said the same thing. No trainer visibility, everything funnels through one person, and unless someone is already highly motivated they never even think about training.\n\nAt first I wanted to suggest just a trainer wall where we hang photos but I thought that would take too long so I made a super basic little team page and QR code for my gym. Nothing fancy. Just “here are the trainers, here’s what they do, scan if you want a session.” I honestly just wanted to see if anyone would even bother.\n\nPeople actually started scanning it right away which surprised me. Couple session requests came in the first week. It at least proved that awareness was the missing piece, not interest.\n\nThen I posted in a couple niche subreddits (personal training, gym owners) just to sanity check myself and the feedback was basically “yep, same problem here.” Some gym owners said they’ve been looking for something like this for years. Others said members walk past trainer bios all day and still don’t realize who trains who. One person even said they’ve been on the gym floor for a year and members still think they work the front desk.\n\nNow I’m in this weird spot where the early signal is good but I don’t wanna jump into full startup mode without making sure I’m not just seeing a weird local pattern.\n\nSo I guess my questions for anyone who’s done niche products or vertical SaaS are:\n\nhow do you tell if early traction is actually traction?\nwhat signals did you use to know whether or not this is worth building”?\nhow do you validate something like this without accidentally biasing the answers?\nand could this still be a local fluke even though the feedback has been consistent?\n\nNot selling anything, not looking for customers. Just trying to think clearly before I go too deep.\n\nWould love any advice from people who’ve built in these weird real world niches\n\nThank you!!",
    "author_name": "platesandpadwork_",
    "author_profile_link": "https://www.reddit.com/user/platesandpadwork_",
    "post_url": "https://www.reddit.com/r/startups/comments/1pbr9ao/trying_to_validate_an_idea_in_the_gym_space_early/",
    "subreddit": "startups",
    "keyword_matched": "validating an idea",
    "scraped_at": "2026-02-18T00:43:18Z"
  },
  {
    "content": "How do you validate an idea properly? I will not promote\nCurious, how do you guys validate an idea and make sure you reach large enough audience to know if the idea is worth building or not? Do you use ads, do you post on communities, how do you reach your audience and where do you find the people willing to pay for your product ?",
    "author_name": "vujsa7",
    "author_profile_link": "https://www.reddit.com/user/vujsa7",
    "post_url": "https://www.reddit.com/r/startups/comments/1lsz7un/how_do_you_validate_an_idea_properly_i_will_not/",
    "subreddit": "startups",
    "keyword_matched": "validating an idea",
    "scraped_at": "2026-02-18T00:43:18Z"
  },
  {
    "content": "I will not promote - just wanting to validly an idea\nI will not promote - just wanted to validate an idea\n\nI wasn’t actually planning on posting in here, but this has been bugging me for some time now. \n\nI’ve been for jobs on and off, and more recently I’ve also been around people who were hiring/in the recruitment field (my wife included). Seeing both sides kind of back to back has been….confusing I guess. \n\nBasically, what keeps standing out to me isn’t necessarily the rejection or competition. That part I get. It was more how unclear everything feels before anyone even talks. \n\nWhen I was applying, still applying the way, half the time I genuinely could tell: am I even remotely what they’re looking for, or are they also what I am looking for - not sure if I am just guessing? \n\nAnd then watching hiring from the other side, my wife works from home and friends in this field too, it felt like the opposite problem - loads of applications, but still a lot of “I don’t know, this one just feels off” type of decision.😳 \n\nIt could just be me reading too much into it, but after reading multiple hiring, job, recruitment subreddits and some blogs/research, it feels and looks like everyone’s frustrated for different reasons and no one’s really talking about the same thing. \n\nAs mentioned, I am not here to promote - I just trying to sanity-check this before I go down into a rabbit hole of building a solution around resolving this pain point.\n\nIf you’re currently job hunting - what part of the process felt the most unclear and pointless? \n\nAnd on the other side, for founders hiring people - what’s the hardest part to actually explain, either to candidates or internally? \n\nGenuinely curious whether this is a real pattern or just my own experience. Because I have an idea that will solve this mismatch, making sure company job post and candidate requirements match before they can even match each-other.",
    "author_name": "FullAd2253",
    "author_profile_link": "https://www.reddit.com/user/FullAd2253",
    "post_url": "https://www.reddit.com/r/startups/comments/1qdqbzc/i_will_not_promote_just_wanting_to_validly_an_idea/",
    "subreddit": "startups",
    "keyword_matched": "validating an idea",
    "scraped_at": "2026-02-18T00:43:18Z"
  },
  {
    "content": "How do you validate an idea?\nI have an idea of a product that would solve a pain point that I currently have. I briefly looked online for similar apps but didn't find anything quite similar (I might have to look more). Now I want to validate the idea *before* start building something. How do you do that? What tools do you use?",
    "author_name": "JackC8",
    "author_profile_link": "https://www.reddit.com/user/JackC8",
    "post_url": "https://www.reddit.com/r/startups/comments/u8sl7p/how_do_you_validate_an_idea/",
    "subreddit": "startups",
    "keyword_matched": "validating an idea",
    "scraped_at": "2026-02-18T00:43:18Z"
  },
  {
    "content": "How to validate an idea and accept pre-order money before forming your business entity? - I will not promote\nWhat is the proper way to collect pre-orders? Collecting emails is one thing, but collecting pre-orders is another. In order to collect pre-order money you need an EIN. Do you have an LLC to handle all of the different business validations, do you form first, or do you get your EIN then form? The goal is form as a c-corp for different projects, but it seems inefficient to form then validate by collecting pre-orders (among other tactics). What's the proper or most efficient way to validate and take pre-orders that doesn’t limit any of the benefits of forming a c-corp?",
    "author_name": "Idea_Plastic",
    "author_profile_link": "https://www.reddit.com/user/Idea_Plastic",
    "post_url": "https://www.reddit.com/r/startups/comments/1p6dtxt/how_to_validate_an_idea_and_accept_preorder_money/",
    "subreddit": "startups",
    "keyword_matched": "validating an idea",
    "scraped_at": "2026-02-18T00:43:18Z"
  },
  {
    "content": "If only someone told me this before my 1st startup\n##1. Validate idea first.  \nI wasted at least 5 years building stuff nobody needed.  \n##2. Kill your EGO.  \nIt's not about me, but the user. I must want what the user wants, not what I want.  \n##3. Don't chaise investors, chase users, and then investors will be chasing you.  \n##4. Never hire managers.  \nOnly hire doers until PMF.  \n##5. Landing page is the least important thing in a startup.  \nPick an average template, edit texts and that's it.  \n90% of the users will end up on your site coming from a blog article, social media post, a recommendation. Which means they have the intent. No need to \"convert\" them again.  \n##6. Hire only fullstack devs.  \nThere is nothing less productive in this world than a team of developers.  \nOne full stack dev building the whole product. That's it.  \n##7. Chase global market from day 1.  \nIf the product and marketing are good, it will work on the global market too, if it's bad, it won't work on the local market too. So better go global from day 1, so that if it works, the upside is 100x bigger.  \n##8. Do SEO from day 2.  \nAs early as you can. I ignored this for 14 years. It's my biggest regret.  \n##9. Sell features, before building them.  \nAsk existing users if they want this feature. I run DMs with 10-20 users every day, where I chat about all my ideas and features I wanna add. I clearly see what resonates with me most and only go build those.  \n##10. Hire only people you would wanna hug.  \nMy mentor said this to me in 2015. And it was a big shift. I realized that if I don't wanna hug the person, it means I dislike them. Even if I can't say why, but that's the fact. Sooner or later, we would have a conflict and eventually break up.  \n##11. Invest all money into your startups and friends.  \nNot crypt0, not stockmarket, not properties.  \nI did some math, if I kept investing all my money into all my friends’ startups, that would be about 70 investments.  \n3 of them turned into unicorns eventually. Even 1 would have made the bank. Since 2022, I have invested all my money into my products, friends, and network.  \n##12. Post on Twitter daily.  \nI started posting here in March this year. It's my primary source of new connections and traffic.  \n##13. Don't work/partner with corporates.  \nCorporations always seem like an amazing opportunity. They're big and rich, they promise huge stuff, millions of users, etc. But every single time none of this happens. Because you talk to a regular employees there. They waste your time, destroy focus, shift priorities, and eventually bring in no users/money.  \n##14. Don't get ever distracted by hype, e.g. crypt0.  \nI lost 1.5 years of my life this way.  \nI met the worst people along the way. Fricks, scammers, thieves. Some of my close friends turned into thieves along the way, just because it was so common in that space. I wish this didn't happen to me.  \n##15. Don't build consumer apps. Only b2b.  \nConsumer apps are so hard, like a l",
    "author_name": "johnrushx",
    "author_profile_link": "https://www.reddit.com/user/johnrushx",
    "post_url": "https://www.reddit.com/r/startups/comments/18q1pkl/if_only_someone_told_me_this_before_my_1st_startup/",
    "subreddit": "startups",
    "keyword_matched": "validating an idea",
    "scraped_at": "2026-02-18T00:43:18Z"
  },
  {
    "content": "Trying to validate an idea - sandboxed cloud desktops for AI agents (i will not promote)\nHey all,\n\nI’m testing an idea for a SaaS for developers and AI enthusiasts:\n\nProblem - running AI agents is messy. Developers need isolated environments with browsers, scripts, and storage. Current solutions are slow, manual, or don’t scale.\n\nProposed solution - spin up a disposable cloud desktop for your AI agent - Linux-based, pre-configured with browsers and dev tools. The environment exists for the task and then disappears.\n\nPotential benefits:\n\n* Run agents without setup headaches\n* Experiment safely without messing up your local machine\n* Debug or replay agent actions in a controlled space\n\nQuestions:\n\n1. Would you pay for this?\n2. What features would make it worth using?\n3. How do you currently run/test AI agents?\n\nLooking for honest feedback to see if this is actually solving a problem or just a cool idea.",
    "author_name": "Spiritual_Actuator61",
    "author_profile_link": "https://www.reddit.com/user/Spiritual_Actuator61",
    "post_url": "https://www.reddit.com/r/startups/comments/1nvaoeq/trying_to_validate_an_idea_sandboxed_cloud/",
    "subreddit": "startups",
    "keyword_matched": "validating an idea",
    "scraped_at": "2026-02-18T00:43:18Z"
  },
  {
    "content": "[True Story] Non-technical founder tried to sell a 100% AI-generated MVP to a bank - I will not promote\nGot a call yesterday from someone in my network. Fintech founder, zero technical background. Says she got hacked. As she tells me the story, I can't believe the chain of events.\n\nStarted like many do now: lovable, v0, cursor. Generating screens, connecting APIs. Great for validation at first. Problem is, she kept going. MONTHS wrestling with prompts until she had a monster with:\n\n* Credit scoring\n* AI agents\n* Dashboards\n* Reports\n* And many more\n\nAll prompt-generated. Zero understanding of the code. Shows it to a BANK. They like it. Tell her to move forward (she had a great business network btw). No idea what to do. Hires a team to \"refactor\". Quote: 300+ hours. Basically the cost of building a proper MVP from scratch.\n\nBut wait, it gets better.\n\nThe team she hired ALSO does vibe coding. They set up the server by asking ChatGPT. Result:\n\n* SSH open to the world\n* Root password: admin123 (or something similar)\n* No firewall\n* Nothing\n\nAutomated ransomware encrypted everything. Had to shut down, rotate all API keys (costing $$$), migrate everything.\n\nThe founder lost money on the hack, so much time, credibility with the client and trust in the process.\n\nHere's the thing: Would you send a contract to a client without reading it, just because AI wrote it? Would you send an investor pitch without knowing what it says? Of course not. So why would you run your entire technical infrastructure on code you can't read?\n\nAI amplifies what you already know. If you understand business, AI makes you better at business. If you know code, AI makes you code 10x faster. But if you know nothing about code and try to build a tech product with just prompts, you're not in control of your own company.\n\nThe new reality post-AI: You don't need 10 developers anymore. You need 1-3 people who REALLY know their domain, amplified by AI. That's more powerful than 20 people without AI.\n\nThat's what vibe coding in production is: unsupervised juniors all the way down.",
    "author_name": "micupa",
    "author_profile_link": "https://www.reddit.com/user/micupa",
    "post_url": "https://www.reddit.com/r/startups/comments/1oex6aw/true_story_nontechnical_founder_tried_to_sell_a/",
    "subreddit": "startups",
    "keyword_matched": "validating an idea",
    "scraped_at": "2026-02-18T00:43:18Z"
  },
  {
    "content": "Project idea validation: Would you like an app to track your books, movies, music, etc all in one place?\nI use goodreads for books, letterboxd for movies, and rate your music for music. In my country there's an app for tracking and reviewing all of them (and more) in one place. I can also add friends and receive their updates in my feed. Would someone like a similar app in English?",
    "author_name": "KaleidoscopeLivid331",
    "author_profile_link": "https://www.reddit.com/user/KaleidoscopeLivid331",
    "post_url": "https://www.reddit.com/r/startups/comments/1fxrtm6/project_idea_validation_would_you_like_an_app_to/",
    "subreddit": "startups",
    "keyword_matched": "validating an idea",
    "scraped_at": "2026-02-18T00:43:18Z"
  },
  {
    "content": "How many waitlist sign-ups are enough to validate an idea?\nI’ve been working on a tool that uses AI to help businesses find the best platforms to reach their audience, generate tailored content, and track leads. It’s still early days, but we’ve set up a landing page with a waitlist to gauge interest.\n\nI’m curious—how many sign-ups would you consider enough to validate an idea like this?\n\nWould love to hear your thoughts!",
    "author_name": "Fluffy-Guidance3399",
    "author_profile_link": "https://www.reddit.com/user/Fluffy-Guidance3399",
    "post_url": "https://www.reddit.com/r/startups/comments/1hnf34s/how_many_waitlist_signups_are_enough_to_validate/",
    "subreddit": "startups",
    "keyword_matched": "validating an idea",
    "scraped_at": "2026-02-18T00:43:18Z"
  },
  {
    "content": "How do you validate an idea ?\nI’ve been working on a project with a friend for a while now and we both think that it has potential . We also asked some friends and families and they also think that it’s a good idea. But I still don’t know if the idea is validated since I need to ask actual potential users if the project has some value for them . How do you guys find potential users ? And do you just make posts explaining the project hoping that people find it interesting ? I might still be naive since this is my first big project , but won’t my idea be stolen if I just post about it online ?",
    "author_name": "Serious_Worker_9871",
    "author_profile_link": "https://www.reddit.com/user/Serious_Worker_9871",
    "post_url": "https://www.reddit.com/r/startups/comments/1e9hkzm/how_do_you_validate_an_idea/",
    "subreddit": "startups",
    "keyword_matched": "validating an idea",
    "scraped_at": "2026-02-18T00:43:18Z"
  },
  {
    "content": "HOW TO VALIDATE AN IDEA? (I will not promote)\nI’m building a web app based community where founders get real, brutally honest feedback on startup ideas, with this I just truly want to help people validate their ideas quick by presenting them in front of users and audience to promote their ideas and latest builds.\n\nI am not promoting my idea, just helping people who don't want to get trapped in the validation hell and turn out to build something no one wants to use.\n\nLet me know your thoughts!",
    "author_name": "Ok_Onion_705",
    "author_profile_link": "https://www.reddit.com/user/Ok_Onion_705",
    "post_url": "https://www.reddit.com/r/startups/comments/1jpkbt1/how_to_validate_an_idea_i_will_not_promote/",
    "subreddit": "startups",
    "keyword_matched": "validating an idea",
    "scraped_at": "2026-02-18T00:43:18Z"
  },
  {
    "content": "How to find the right people to talk to to validate an idea (I will not promote)\nI will not promote.\n\nI’m building SaaS product and need to validate my idea by talking to people in my specific niche. I know there over 600k of them out there, but it’s a community where most seem to not be easily discoverable online (at least not in a way that I've found so far).\n\nSo far I’ve:\n\n* Found one channel where I was able to identify around 100 people\n* Reached out 100% of them\n* Achieved about a 4% response rate\n* Spoken to 5 people total including people that were referred to me from the 4% that responded\n\nI know to truly validate I need to get in front of many more people, but I feel like I'm running down tons of dead ends trying to find them. What I really want is to connect with content creators who run newsletters, ideally ones who use Kit.\n\nWhat strategies or tools would you recommend for finding and reaching more of these newsletter creators? Are there any online directories (other than the one that Kit has on their website, which is what I used for the above), social media hashtags or searches, communities, or outreach strategies that have worked well for you or that you know of?",
    "author_name": "smith7264",
    "author_profile_link": "https://www.reddit.com/user/smith7264",
    "post_url": "https://www.reddit.com/r/startups/comments/1kikugi/how_to_find_the_right_people_to_talk_to_to/",
    "subreddit": "startups",
    "keyword_matched": "validating an idea",
    "scraped_at": "2026-02-18T00:43:18Z"
  },
  {
    "content": "Validating an idea: conversational search for e-commerce (I WILL NOT PROMOTE)\ni will not promote\n\nWorking on validating a potential startup concept and would love this community's perspective.\n\nThe Problem: We know e-commerce site search is often clunky. Standard keyword search fails with synonyms, typos, and complex user needs. Data suggests this friction is a major driver of cart abandonment (seen stats like \\~68% abandonment due to poor search) and lost revenue for online stores.\n\nThe Idea: A conversational AI search interface for e-commerce sites. Instead of keywords, customers use natural language (\"looking for durable, waterproof hiking boots under $200 in a size 10\"). The product understands context, refines results through conversation, and crucially, is trained only on that specific store's inventory to give accurate, hallucination-free results. Think of it as a dedicated, expert sales assistant for each online shop.\n\nPotential Upside: Some research points to NLP search lifting orders (+8.5%) and significantly boosting conversion rates/AOV (+17%). For stores, this could directly impact the bottom line.\n\nKey questions:\n\n1. Problem significance: How big of a pain point is subpar e-commerce search really for businesses? Is it a top-tier problem worth solving with dedicated tech?\n2. Solution viability: Does a conversational approach feel like the right solution here, or is it overkill compared to just improving keyword search algos? Would businesses see enough ROI to pay for it (thinking SaaS model)?\n3. Adoption risk: Would end-consumers actually use a chat-like interface for search regularly, or is the standard search bar too ingrained?\n4. Key challenges: Beyond the core AI tech, what are the biggest hurdles you foresee? (e.g., Integration complexity with platforms like Shopify/Magento, sales cycle, proving ROI, competition from platform-native features?)\n\nTrying to gauge if there's real market pull here or if it's just a cool tech application looking for a problem. Appreciate any hard-hitting feedback or insights from your experiences.\n\nTo mention: zalando already did it with its assistant, amazon with rufus.",
    "author_name": "andriyklitsuk",
    "author_profile_link": "https://www.reddit.com/user/andriyklitsuk",
    "post_url": "https://www.reddit.com/r/startups/comments/1k89b8s/validating_an_idea_conversational_search_for/",
    "subreddit": "startups",
    "keyword_matched": "validating an idea",
    "scraped_at": "2026-02-18T00:43:18Z"
  },
  {
    "content": "How can you validate an idea that does not solve any problem? I will not promote\nI saw something cool in Kickstart and I thought it was cool. In fact it was so cool that I wanted it. But here is the thing: It didn't fix any problem I had and I didn't need it. And yet it was just so cool that I wanted it. And it wasn't just me, the startup apparently got the funding it needed in its first 5 minutes of being in Kickstart (I am fairly skeptical about this, but it got around 750k dollars).\n\nI am reading the mom test (just finished the chapter that talks about customer commitment vs advancement) and in general the book seems to focus on problems but sometimes a product doesn't have to solve a problem to be good and have people pay for it. What then? How do you proceed in this case?\n\nI will not promote",
    "author_name": "4dr14n31t0r",
    "author_profile_link": "https://www.reddit.com/user/4dr14n31t0r",
    "post_url": "https://www.reddit.com/r/startups/comments/1ij57n3/how_can_you_validate_an_idea_that_does_not_solve/",
    "subreddit": "startups",
    "keyword_matched": "validating an idea",
    "scraped_at": "2026-02-18T00:43:18Z"
  },
  {
    "content": "Need an idea validation [i will not promote]\nI felt overwhelmed by the number of videos and emails I have been watching every day, to stay informed about crypto markets, so I decided to save my own time.\n\nTo achieve that i built myself a software with following features:\n- it creates a summaries of crypto-related YouTube contents and newsletters,\n- i can highlight even smaller parts of the summary, that are the most important,\n- write comments on top of highlights,\n- all highlighted sentence are grouped by day in my-highlights page,\n- every summary can bookmarked and viewed later from my bookmarks section,\n\nLater i thought that this could be more than just a pet project so i’ve added subscription tiers, that is in sandbox mode at the moment.\n\nI’ve got more ideas, how to expand it but they all make sense if there are people that will use it.",
    "author_name": "alx_raj",
    "author_profile_link": "https://www.reddit.com/user/alx_raj",
    "post_url": "https://www.reddit.com/r/startups/comments/1j7l24x/need_an_idea_validation_i_will_not_promote/",
    "subreddit": "startups",
    "keyword_matched": "validating an idea",
    "scraped_at": "2026-02-18T00:43:18Z"
  },
  {
    "content": "Built out an idea recently but realized we didn't do enough customer validation\nHey folks, my co-founder and I have built a new idea recently but we realized that it might not be a strong enough pain point for users to actually pay for it after validating it with a few folks. Are we headed in the right direction? Feeling a little lost at the moment.\n\nFwiw, we're building a social blogging platform with an answering engine front that is aimed at building a curated knowledge base from thought leaders. The answering engine front would help to answer day to day users' questions directly with supporting sources from both our platform and the web. It aims to fight misinformation and information overload overall.\n\nWe figured this could really help in the wellness space especially sexual health as there is still an ongoing stigma around this topic and people are afraid to seek help in person from where I'm at. We're thinking this could help with entrepreneurship-related topics, self-help and many more as well but we're not sure if it's enough for folks to pay for it.",
    "author_name": "CreativeFall7787",
    "author_profile_link": "https://www.reddit.com/user/CreativeFall7787",
    "post_url": "https://www.reddit.com/r/startups/comments/17crsc4/built_out_an_idea_recently_but_realized_we_didnt/",
    "subreddit": "startups",
    "keyword_matched": "validating an idea",
    "scraped_at": "2026-02-18T00:43:18Z"
  },
  {
    "content": "The rush you get from an validated idea is astounding.\nEarly this year, I cut all ties with the small business I built as employee one over the last decade, moved to a new city and started my own tech business. \n\nDuring my MBA dissertation I identified a big pain point in a big industry and wanted to solve it. So I derived an idea and even won a six-digit government grant to develop it, build a team of five and went at it. \n\nBut the more I spoke with customers, the more I realised that they all agreed that this pain point needs to be solved, but I rarely got excitement for my approach to do so. Don’t get me wrong — I got approval, validation, but no _excitement_. \n\nHalf a year into development and with the first launch contract under our belt, I kept talking with more potential customers and can’t stress enough how important that is. Because last week it made click: I realised how customers would want to solve the pain point, even though they did not know yet. \n\nDeriving this idea from hard work, researching and researching, made me euphoric. I knew this would be good, but still reached out to a dozen customers to ask for their opinion. And guess what: now they are excited. \n\nMy team is a bit puzzled that we shift now, but I found a way to leverage what we have well and get a free MVP out asap. Hopefully until end of this month, so I can finally show for something and get potential customers at it. I’m thrilled, and just wanted to share. \n\nTL;DR: Keep talking to customers!!!",
    "author_name": "TheWorldIsOnlyYours",
    "author_profile_link": "https://www.reddit.com/user/TheWorldIsOnlyYours",
    "post_url": "https://www.reddit.com/r/startups/comments/16kuvnc/the_rush_you_get_from_an_validated_idea_is/",
    "subreddit": "startups",
    "keyword_matched": "validating an idea",
    "scraped_at": "2026-02-18T00:43:18Z"
  },
  {
    "content": "How do you validate an idea before building a product?\nHello there!\n\nI have a big experience of building various products, many of which failed due to lack of product market fit or not addressing a real problem(for which people ready to spend their money).\n\nSo I have decided to start by finding and validating a problem before building a product. Right now I'm at the first step.\n\nI have some hypothesis, which I want to validate.\n\nRight now I use two channels for validating: LinkedIn Sales Navigator and Reddit. However, I'm finding the outreach and interview process a bit frustrating. With Sales Navigator I connect to people(found them with filters) and after the connection I write to them a short message with couple of questions.\n\nBut the process feels slow, and I'm wondering if there might be a better way to reach out to people.\n\nSo I'm really curious about your experience:\n\n1. What tools or frameworks do you use to find and validate ideas and problems?\n\n2. And if you use Sales Navigator, how do you use for this purpose?\n\nI really appreciate any answers and feedback!",
    "author_name": "jurassimo",
    "author_profile_link": "https://www.reddit.com/user/jurassimo",
    "post_url": "https://www.reddit.com/r/startups/comments/1efulvf/how_do_you_validate_an_idea_before_building_a/",
    "subreddit": "startups",
    "keyword_matched": "validating an idea",
    "scraped_at": "2026-02-18T00:43:18Z"
  },
  {
    "content": "Validating an app idea\nI was thinking of building an ai assistant that reminds me of important stuff that I need to do. I see a lot of reminder apps that have too many things going on as they add features to cover every small possibility one may have. Instead this app will focus on a single task - making sure you are on top of the important shit - you instruct the app about important things - like - 'remind me to renew insurance in march before the 20th', or 'renew passport this year', or 'get a fasting blood test a week before my next doc visit in june', cancel fubo subscripton next week (especially when using a free trial to catch an event :) ) ....and more.  \nAnyone relate to this / find it interesting enough to install an app?",
    "author_name": "thisisthewaiye",
    "author_profile_link": "https://www.reddit.com/user/thisisthewaiye",
    "post_url": "https://www.reddit.com/r/startups/comments/1gv1ibw/validating_an_app_idea/",
    "subreddit": "startups",
    "keyword_matched": "validating an idea",
    "scraped_at": "2026-02-18T00:43:18Z"
  },
  {
    "content": "Pre-launch anxiety as a solo founder how do you stay focused?[i will not promote]\nI’ve read and acknowledge the r/startups rules.\n\n\n\nI’m a solo founder working on my first startup and I’m struggling mentally before launch. I keep worrying about whether it will ever generate revenue, even though the product isn’t finished yet. That fear is affecting my ability to focus day to day and actually make progress.\n\n\n\nBecause I’m building alone, I feel stuck in my own head and keep overthinking long-term outcomes instead of completing near-term tasks. I’m not sharing my product, links, or asking for promotion or feedback I’m looking for discussion around mindset.\n\n\n\nFor founders who’ve been through this stage: how did you manage pre-launch anxiety and keep moving forward before you had any real validation?",
    "author_name": "No-Scholar6835",
    "author_profile_link": "https://www.reddit.com/user/No-Scholar6835",
    "post_url": "https://www.reddit.com/r/startups/comments/1r03kme/prelaunch_anxiety_as_a_solo_founder_how_do_you/",
    "subreddit": "startups",
    "keyword_matched": "pre-launch",
    "scraped_at": "2026-02-18T00:43:21Z"
  },
  {
    "content": "Seeking Advice on Pre-Launch Growth &amp; Fundraising for a Web3 Risk-Management Startup [I will not promote]\nHi guys, I'm a developer with few years of experience in the Web3 field, and my colleague and I have identified a huge need that could turn into a market opportunity, so we would like some advice on how you would manage the pre-launch growth phase.\n\n**Context**: We are developing a Web3 service in the field of risk management. Potential customers could be DeFi protocols, audit companies, or end users. I've been working in Web3 for years, and this is something that could be really needed in DeFi.\n\n**Development status**: Brand identity, architecture, and product validation with a dozen members of another Web3 community who told us whether they would use such a product has been completed with positive results.\n\n**Goal**: to network and raise funds. Possibly with a VC that can support us, otherwise even the foundation of an EVM ecosystem is fine.\n\n**Advice**: I would like your opinion on how you would manage the development of the MVP with community growth and by proposing us to some VCs or foundations for strategic support. Let me explain what I would do:\n\n\\-Develop a very basic MVP\n\n\\-Develop a landing page\n\n\\-I would form a small group of testers with the members I mentioned earlier\n\n\\-I would contact a group of audit companies and DeFi protocols to gauge their interest, adding them to the community\n\n\\-Develop a pitch deck with financial and business-oriented metrics along with the traction gained until this point with early users and customers.\n\nThen I would try to reach out some VCs active in Pre-Seed with Web3 as a vertical.\n\nIf we don't get any interest, I would try to grow our community further and then contact some Ecosystem Foundations (I've noticed that they are very interested in this aspect).\n\nWhat do you think? Would you change anything? Do you have any advice for me? Anything is welcome, thank you!",
    "author_name": "gkm-chicken",
    "author_profile_link": "https://www.reddit.com/user/gkm-chicken",
    "post_url": "https://www.reddit.com/r/startups/comments/1qhy436/seeking_advice_on_prelaunch_growth_fundraising/",
    "subreddit": "startups",
    "keyword_matched": "pre-launch",
    "scraped_at": "2026-02-18T00:43:21Z"
  },
  {
    "content": "Pre-Launch Dessert Cart Brand needing some FOCUS - I will not promote\n**Background:** I’ve had a lot of entrepreneurial experience, but often my ego has gotten in the way of learning how others do it and emulating. Instead I’ve walked uphill, constantly trying to reinvent the wheel. As a result, I have had amazing ideas that generated lower profit than they should or weren’t profitable at all.\n\nThis time I’m trying to do things smarter, but I’m running into some focal challenges.\n\n**Business:** Mexican-American themed desserts. Clean ingredients. Made from scratch. Allergen aware. Churros, Funnel Cakes, Fried Plantains to start.\n\n**Goal:** Finally launch a business I’m passionate about and not just something I can make money doing, but loathe.\n\nLaunch brand, push heavy on SMS and social media. Quickly grow into multiple locations where I can develop recipes, be involved in marketing, and not actually touch day-to-day operations.\n\n**Current Obstacle:** We want to do some pre-launch free pop-ups. But I want to maximize on the marketing opportunity. The food is free, but I want to collect SMS, social media followers, and content.\n\n**Question:** How would YOU go about this?",
    "author_name": "Prize_Wait8146",
    "author_profile_link": "https://www.reddit.com/user/Prize_Wait8146",
    "post_url": "https://www.reddit.com/r/startups/comments/1r0d3al/prelaunch_dessert_cart_brand_needing_some_focus_i/",
    "subreddit": "startups",
    "keyword_matched": "pre-launch",
    "scraped_at": "2026-02-18T00:43:21Z"
  },
  {
    "content": "What does market validation looks like in a pre-launch startup - and is it even possible to raise at this stage? I will not promote\nI am at the building MVP phase - no launch, no revenue yet. I need clarity on two things.\n\n1.market validation\nI got general data on potential users target and potential people experiencing the problem; I got ~50 survey answers that validate willingness by users to pay for the service I hope to provide. I got  also a couple of interviews with favourable results. Is this enough, what do investors expect at this stage to invest ?\n\n2. Raising funds\nI know the mainstream proposition is bootstrap first and then go to investors. But what if bootstrap is not even an option with not enough fundings (more than what I can personally invest) and it could even be damaging the product long term reputation? \nIs it possible to go to investors and say “look this is the product we will launch, this is a model showing where money will be invested, this is the results of such investments, and this is the revenue we expect it to generate once we’re live”. Would investors invest in this way or its a “don’t waste your time” type of thing?\n\nThanks in advance",
    "author_name": "Technical_Matter9230",
    "author_profile_link": "https://www.reddit.com/user/Technical_Matter9230",
    "post_url": "https://www.reddit.com/r/startups/comments/1md60pa/what_does_market_validation_looks_like_in_a/",
    "subreddit": "startups",
    "keyword_matched": "pre-launch",
    "scraped_at": "2026-02-18T00:43:21Z"
  },
  {
    "content": "Is it really possible to get funding pre launch?\nHey!\n\nTechnical founder (10+ years fintech engineer/lead/cto/ in designing/building fx/payments systems) here, working on an MVP.\n\nMe and my sister (who is a lawyer) want to push this for investment before getting clients. We could bootstrap, but for various reasons I believe it’s not a smart move.\n\nSeeking investment would create the necessary hiring power and marketing (fintech events) that would enable us to capture large clients we need for this to work.\n\nI am decently connected in the industry.\n\nI’m looking into pre-seed/pre-launch. I’m wondering what people’s anecdotal experience is like in successfully pulling this off?\n\nI’m trying to raise £1m, but this will fluctuate.",
    "author_name": "Street_Attorney_9367",
    "author_profile_link": "https://www.reddit.com/user/Street_Attorney_9367",
    "post_url": "https://www.reddit.com/r/startups/comments/1hx1z81/is_it_really_possible_to_get_funding_pre_launch/",
    "subreddit": "startups",
    "keyword_matched": "pre-launch",
    "scraped_at": "2026-02-18T00:43:21Z"
  },
  {
    "content": "VCs are reaching out pre-launch: take intro calls or defer? [I will not promote]\nWe’re building an AI startup. Still in stealth - beta to be launched soon.\n\nLately, a few well known VCs  have reached out, some followed up again, and a couple even dropped calendar invites. We’re not raising yet — plan is to launch, get real traction, then fundraise. But unsure if deferring these connects might come off as disinterest.\n\nWould love to hear from founders (or VCs) — is it better to take quick pre-launch intro calls and be transparent, or wait till we have something solid (traction) to show?\n\nThanks in advance!",
    "author_name": "Historical-Cycle-258",
    "author_profile_link": "https://www.reddit.com/user/Historical-Cycle-258",
    "post_url": "https://www.reddit.com/r/startups/comments/1ksy9b0/vcs_are_reaching_out_prelaunch_take_intro_calls/",
    "subreddit": "startups",
    "keyword_matched": "pre-launch",
    "scraped_at": "2026-02-18T00:43:21Z"
  },
  {
    "content": "Solo Founder with Disruptive Med-Tech IP: Should I Raise Capital, Partner with Distributors, or PreLaunch via Kickstarter? I will not promote\nAs a US-based LLC, I've developed an innovative medical technology product with a substantial market potential and volume (estimated at $7–8B, comparable to household appliances). The company holds intellectual properties, including global patents and registered trademarks (featuring the world’s first \\[ABC\\]).\n\nThe founder, who is budget-conscious and currently based in Asia, already has a small-scale manufacturing setup there (leveraging low production costs) but is open to relocating operations to the US or China if needed.\n\n\\*Given these factors, what would be the most effective launch strategy:\n\n(a)Seeking VC funding to scale quickly,\n\n(b)Partnering with distributors for broader market access, or\n\n(c)  a pre-launch campaign (e.g., Kickstarter)?\\*\n\n\\*Additional considerations:\n\nHow might manufacturing location (Asia vs. US/China) impact funding, costs, or partnerships?\n\nAre there hybrid approaches (e.g., crowdfunding first, then VC/distribution) that align with tight budget constraints?\"\\*\n\n  \nI will not promote.",
    "author_name": "kaysoncheikh",
    "author_profile_link": "https://www.reddit.com/user/kaysoncheikh",
    "post_url": "https://www.reddit.com/r/startups/comments/1jvvrsa/solo_founder_with_disruptive_medtech_ip_should_i/",
    "subreddit": "startups",
    "keyword_matched": "pre-launch",
    "scraped_at": "2026-02-18T00:43:21Z"
  },
  {
    "content": "Pre-launch: Can I please get some feedback?\nHi people! I was here before to share that I’m working on something but wasn’t sure about when to launch it. Okay, now it’s live and I’m yet to talk about it with the target audience. I’m looking for feedback on this, even if you aren’t the target audience, can you please let me know what you think? In terms of UI, the features (do they make sense?), the content on the site, does it make you understand what the app does? Anything will be useful. The link is [Notrix](https://notrix.io) thank you!",
    "author_name": "yoyo_programmer",
    "author_profile_link": "https://www.reddit.com/user/yoyo_programmer",
    "post_url": "https://www.reddit.com/r/startups/comments/18rg4za/prelaunch_can_i_please_get_some_feedback/",
    "subreddit": "startups",
    "keyword_matched": "pre-launch",
    "scraped_at": "2026-02-18T00:43:21Z"
  },
  {
    "content": "Have MVP. Launch on test flight or get pre-seed investors? Competitors are big\nI know the normal advice is build a business with mvp, go to investors later. The concern is that I have 2 competitors that are very well established with a huge user base. My MVP alone improves on their offering. \n\nI’d love to hear the benefits / risk of either decision. Is there an argument that in this case it might be better to get funding and grow quickly so that it takes the competitors by surprise? \n\nI’ll just add, even if the competitors copy my MVP, I would still have a lot more improvements and features to add that are not yet in my mvp. So basically if they copied my mvp, I’d release next feature, if they copied that, I’d release next feature, so on. Thanks for your advice!",
    "author_name": "emster549",
    "author_profile_link": "https://www.reddit.com/user/emster549",
    "post_url": "https://www.reddit.com/r/startups/comments/1ev9ljt/have_mvp_launch_on_test_flight_or_get_preseed/",
    "subreddit": "startups",
    "keyword_matched": "pre-launch",
    "scraped_at": "2026-02-18T00:43:21Z"
  },
  {
    "content": "Day 2 Creating Pre-Launch Hype so My Startup Reaches 10k Users\n**What got done today:**\n\n\r  \n**Content Creation:**\r\n\n* Finalized my promo video on Canva. I got so excited that I posted on YouTube right away. \r\n   * I realized that I also need to start considering “catchy titles” and the video’s thumbnail. \r\n   * My video has written words (no voice-over) so I didn’t put in captions. I hope that’s not a disadvantage. Does anyone know?\r\n* I googled “viral hooks” and created a 7 second reel to be posted the day after tomorrow. \r\n* I worked on the content calendar for the week. I still need to finalize the captions and hashtags. I also created a column for “catchy title”.\r  \n\n\n**Website**\r\n\n* No update on the broken Facebook link on the website. Will follow up with the Fiverr gig person tomorrow.\n* I started a new Fiverr gig to get a list of keywords to use. \n* I’ve been advised that I should set up an email campaign to keep users “warm”. It’s a great idea and I started to see if I can do it from my free Mailchimp account. Looks like I can, but I need to learn how. Had to pick up the kids so I’ll focus on that tomorrow. \r\n   * Does anyone have any other suggestions for a \\[free\\] provider?\r\n\n&amp;#x200B;\n\n**Business Ops**\n\n* I looked at the status of our trademark registration. Still pending. \n* I had a conference all with my developer about some of the screens. There is one in particular that might need to be redesigned. I have to do some brainstorming. \n\n&amp;#x200B;\n\n**Insights:**\r\n\n* I listened to a podcast on business marketing. \r\n   * It said that I should create “behind-the-scenes” content to attract and build a community. Since I’m not camera savvy and HATE hearing my own voice, I’ll take the Reddit and blogs route. \r\n   * Whenever I post to social media, I need to immediately share the post, comment and like it. This improves the chances of it being sent to non-followers.\r\n\n&amp;#x200B;\n\n**Tomorrow To-Do**\r\n\n* Share promo video on insta\r\n* Follow up on website ordeal\r\n* Look into MailChimp for email campaign\r\n* Look into keywords, hashtags, and captions to use\r  \n\n\n&amp;#8203;\n\n    Subscribers:\r\nEmail: 25 \r\n\r\nYouTube: 0 \r\n\r\nInstagram: 8 \r\n\n\n&amp;#x200B;",
    "author_name": "MindingMomma",
    "author_profile_link": "https://www.reddit.com/user/MindingMomma",
    "post_url": "https://www.reddit.com/r/startups/comments/1csvefe/day_2_creating_prelaunch_hype_so_my_startup/",
    "subreddit": "startups",
    "keyword_matched": "pre-launch",
    "scraped_at": "2026-02-18T00:43:21Z"
  },
  {
    "content": "Stripe alternative for pre-launch/mvp fintech startup. I will not promote\nHello. My team and I are currently working on a new Fintech that will serve as a money transmitter from users to merchants and we plan to generate virtual cards. However, our plan was to use Stripe to generate the virtual cards, but Stripe wouldn’t even allow us discuss with sales our use case let alone approve a live account for us to generate real virtual cards now that we’re bout to launch our mvp after several tests. In the application process they ask if you have raised funds, and we say no, because we’re bootstrapped.  What’s the best alternative to Stripe we could use that allows pre revenue, mvp stage and unfunded startups? Ayden didn’t also approve us. Way forward please. Thanks in advance.",
    "author_name": "Inevitable_Box_9281",
    "author_profile_link": "https://www.reddit.com/user/Inevitable_Box_9281",
    "post_url": "https://www.reddit.com/r/startups/comments/1j5erc2/stripe_alternative_for_prelaunchmvp_fintech/",
    "subreddit": "startups",
    "keyword_matched": "pre-launch",
    "scraped_at": "2026-02-18T00:43:21Z"
  },
  {
    "content": "Where do I even start? Pre-Launch advice and Marketing strategy.\nI've got a SaaS app launching and we're now planning our pre-launch/marketing strategy. I've looked everywhere and I'm building the website, pre-launch, pitch deck and documentation. The product has been tested and we've received some feedback on how to improve from our first users.\n\nWe'll be making blogs to outreach to B2B and also joining subreddits within the niche. But realistically, where do I start? I kinda feel like I've been told all these things to work on but still feeling kinda directionless and not sure what's priority.\n\nWhat would you say I should focus on apart from ensuring my app is working well?",
    "author_name": "AcireBag",
    "author_profile_link": "https://www.reddit.com/user/AcireBag",
    "post_url": "https://www.reddit.com/r/startups/comments/1g3034k/where_do_i_even_start_prelaunch_advice_and/",
    "subreddit": "startups",
    "keyword_matched": "pre-launch",
    "scraped_at": "2026-02-18T00:43:21Z"
  },
  {
    "content": "SaaS Pre-launch waitlist.  Thoughs?\nHi all,\n\nI started working on a new venture 6 months ago and haven been in stealth mode until today. In a nutshell, it's a vertical SaaS/PayFac solution that simplifies complex transactions.  \n\nWe are now about 8 weeks from launching our MVP and I'm working on the pre-launch waitlist to have it ready to go live with the website within the next 5 to 10 days. \n\nI would appreciate your insight on this. Below is what I can think of right now, but please feel free to share anything helpful that I haven't mentioned. \n\n● Tips and tricks that worked for you in the past, both as a founder or a user. \n\n● The best time to launch the waitlist, best channels to use and how much effort and/or money to put behind it. ( Value for money, I guess)\n\n● What kind of rewards you would expect as a user to be enticed to join. (granted that our solution solves a problem for you). \n\n. Is a sign up for early access enough? \n. Would you refer friends to move up the list for early access?\n. Would you refer friends to get a generous discount on premium subscription when the product launches?\n \n\n● Any apps or tools you know about or, ideally, have used and would confidently recommend.\n\n\n● Anything else you can think of! \n\n\nThank you all in advance!",
    "author_name": "ThePayPipeguy",
    "author_profile_link": "https://www.reddit.com/user/ThePayPipeguy",
    "post_url": "https://www.reddit.com/r/startups/comments/1bomevo/saas_prelaunch_waitlist_thoughs/",
    "subreddit": "startups",
    "keyword_matched": "pre-launch",
    "scraped_at": "2026-02-18T00:43:21Z"
  },
  {
    "content": "Good pre-launch marketing strategies with low budget\nHi!  \nMe and a small team of 3 have just started working on creating a business, and are just about to start producing! I am currently in charge of considering different types of strategies, mostly on how to promote the product we are creating.  \nI'm sure this has been asked multiple times, but here goes.  \n  \nRight now, we want more people to know about us and our product, but we would like to gain some attention before we actually start selling the product.\n\nI was wondering if there are some strategies for promotion that work especially well compared to others, even if you have a lower budget. I know there is a lot of information on it on the internet, but it's just really hard to understand and some of the strategies don't really seem like they would actually work.   \nAnyway, that's about it! Also, if there is anything else you think we should know that we likely haven't come across, it would be great if you could tell us!  \nThank you!",
    "author_name": "Lavesta0",
    "author_profile_link": "https://www.reddit.com/user/Lavesta0",
    "post_url": "https://www.reddit.com/r/startups/comments/1hc0f8c/good_prelaunch_marketing_strategies_with_low/",
    "subreddit": "startups",
    "keyword_matched": "pre-launch",
    "scraped_at": "2026-02-18T00:43:21Z"
  },
  {
    "content": "Validation: Success with selling per-use (or token based) access to your MVP pre-launch? I will not promote\nYo r/startups \n\nFor those who have a SaaS/product that provides an end product to your users (e.g. generated doc, summary of something, list etc), did you consider or have success in selling per-use (or even token based) access to your MVP/proof of concept?\n\nFor context, I'm launching an AI powered customer help documentation generation service that allows you to generate help docs, directly from your front-end code.\n\nI have a waitlist rolling, but as part of my pre-sell/validation I was thinking prior to building the fully fledged SaaS, allowing people to pay a small amount (e.g. $2.99USD) to generate a single help doc from a collection of files/components.\n\nHas anyone else tried this as part of their pre-selling/validation strategy and seen success?\n\nI will not promote",
    "author_name": "magnum-nz",
    "author_profile_link": "https://www.reddit.com/user/magnum-nz",
    "post_url": "https://www.reddit.com/r/startups/comments/1iztoku/validation_success_with_selling_peruse_or_token/",
    "subreddit": "startups",
    "keyword_matched": "pre-launch",
    "scraped_at": "2026-02-18T00:43:21Z"
  },
  {
    "content": "Offer to aquire my pre-launched startup by anbother pre-launched startup\nHi, I am a first time founder and in the process of finalizing our MVP. That said, we are pre-launch.\n\nIn some weird \"news fly fast\" fashion, I got approached by the founder of another similar startup working in the same business line but in a different country. Unlike us, they are post-mvp however pre-operations due to some regulatory hurdles. So far they have raised a total of $2 million. By contrast we did not raise a dime so far. Basically, both our startups are pre-launch, almost same domain (theirs is b2c app-based and ours is b2b SaaS-based), different countries, different funding stages.\n\ntheir motivation? is expansion -- both geographically and product (Their product is b2c whereby ours is b2b)\n\nTheir offer is equity swap. We get compensated for equity in their holding co. in exchange of them aquiring our entity - fully. So it will not be in the form of any cash injection. Although they offered to pay salaries.\n\nMy motivation to sell is that I think they have stronger financial backing and thus be able to focus on building instead of fundraising.\n\nRegardless, this whole thing is very obscure for myself and dont know how to go about it.\n\nI will apprecaite any advice. Cheers",
    "author_name": "dubtact",
    "author_profile_link": "https://www.reddit.com/user/dubtact",
    "post_url": "https://www.reddit.com/r/startups/comments/wwgj9d/offer_to_aquire_my_prelaunched_startup_by/",
    "subreddit": "startups",
    "keyword_matched": "pre-launch",
    "scraped_at": "2026-02-18T00:43:21Z"
  },
  {
    "content": "LAUNCH Pre-Accelerator\nJust got an interview for this. Anyone have any background information about the program. Jason is obviously a popular investor, I know people have strong opinion about him—but I’m just trying to be involved in something legit.\n\nAside from getting sales (the main thing), would this be a legit step forward? Figure we could learn a lot. Then it seems like top 10% of companies get an investment, although I’m neither here nor there about it.",
    "author_name": "tailedbets",
    "author_profile_link": "https://www.reddit.com/user/tailedbets",
    "post_url": "https://www.reddit.com/r/startups/comments/1ghev07/launch_preaccelerator/",
    "subreddit": "startups",
    "keyword_matched": "pre-launch",
    "scraped_at": "2026-02-18T00:43:21Z"
  },
  {
    "content": "Best way to pre-sell/ pre-launch your products?\nGuys, we are a brand new ecommerce shop so are learning everything on the go here. Some people have advised us to make sure to test demand/ distribution by pre-sell/ pre launching our products (with a website and pictures and images close to the final products for instance) and see if our distributions/ ads even work and even if there is demand for the product. \n\nThe conundrum for us is that we are still working on finding supplier/ manufacturers for our product, so if we sell now, it will either be: refund the customers, or tell them that the products won’t be available in the next few months. \n\nOur product will be in the personal care/ skincare category targeting a small niche in the market where we don’t think there are many competitors. \n\nAny other advice on how to do this and if this will be effective? The main concern will be if we might be turning away some potential customers by refunding or telling the products won’t be available anytime soon. \n\nOr are there any other ways to do pre-sell/ pre- launch marketing to make sure the products will be successful upon launch?",
    "author_name": "bondtradercu",
    "author_profile_link": "https://www.reddit.com/user/bondtradercu",
    "post_url": "https://www.reddit.com/r/startups/comments/1efeqhb/best_way_to_presell_prelaunch_your_products/",
    "subreddit": "startups",
    "keyword_matched": "pre-launch",
    "scraped_at": "2026-02-18T00:43:21Z"
  },
  {
    "content": "Success or failure? 9 months after launching my social network, pre-revenue, how do you unemotionally decide if it's working or not?\nI've built a social network. It's going alright, I've not put a single dollar into marketing, and we currently have around 12,000 users, with 3,000 monthly active users, and about 500 daily active users. \n\nHere's a screenshot of my analytics [image](https://i.gyazo.com/48b4e1f2ea7ade7dc30f2a870a07777e.png).\n\nA passionate, small, user base, but I'm finding it hard to scale to 100k users for instance. I was kind of expecting word of mouth to travel further than it has, since I don't have money to spend on advertising. Currently hitting about 50-75 new users a day which would put us at 30-35k total users in 1 year (at current growth). The goal for me right now is to hit 100k within a year. That would roughly be 25k monthly active users and would probably give us a decent valuation. \n\nIt's very difficult to bootstrap a social network, but that's kinda where I've found myself. \n\nThe users are about as passionate as it gets.. like.. honestly. It's a startup I'm really happy with, and if you look at social networks most of them take many years to get a name for themselves. Instagram is 9 years old, reddit is 14, facebook 15, twitter 13, snap 8.\n\nSo my little social network at 9 months doesn't look too bad.. especially without the massive backing like some of those networks had. \n\nI still love working on this, don't get me wrong. But how do you know if something is working? What do you guys think?",
    "author_name": "blindmanLICKS",
    "author_profile_link": "https://www.reddit.com/user/blindmanLICKS",
    "post_url": "https://www.reddit.com/r/startups/comments/c5w271/success_or_failure_9_months_after_launching_my/",
    "subreddit": "startups",
    "keyword_matched": "pre-launch",
    "scraped_at": "2026-02-18T00:43:21Z"
  },
  {
    "content": "Day 4 of Creating Pre-Launch Hype so My Startup Reaches 10k Users\n**What got done today:**\r  \n\n\n**Content Creation:**\r\n\n* I was told that yesterday's promo video did not make it clear that the app was not available yet. So I will make it clear in future videos that we launch in the summer. \n* I posted my second reel on Insta/Facebook. This was a short one – about 15 secs. I am happy to report that it was done more smoothly than yesterday.\r\n   * &gt;!Does anyone know whether using audio straight from Instagram is more advantageous than uploading a video with audio?!&lt; Some audios trend, so I would assume it is. \n* I worked on my reel for tomorrow, which is a longer one. I created two versions – one for YouTube and one for Meta platforms. \r\n* I reviewed the keywords provided by the Fiverr gig. The person I contacted went above and beyond. I will be digesting this information so I can optimize my postings and work on my blog.\n\n**Website**\r\n\n* FB Link: No update. I’m pretty sure she’s not going to do this for me so I’ve decided to just hire someone to redo my website. \r\n* Email Campaign:  I started working on a MailChimp template. I discovered https://reallygoodemails.com/, which has great templates. MailChimp makes it easy to create once you decide what you want. I will send out a weekly email that includes: \n   * A feature of the week\n   * A one question survey\r\n   * Link to our socials \n   * Sneak peak of the app (closer to launch)\r\n\n**Insights:**\r\n\n* Micro-bloggers: On a podcast about growing one’s business, the presenter suggested that I reach out to “micro-influencers” to expand my reach. I’ve been thinking to reach out to \r\n   * 30 mom bloggers\r\n   * 25 note-taking bloggers\r\n   * 20 productivity bloggers (different from above)\r\n   * 15 “hot new apps” bloggers\n   * 10 traveling/foodie bloggers\n   * I will compile a list, follow them on social, craft my message and reach out. I’m undecided whether it makes sense to reach out now or closer, ask them to do beta testing, or closer to my launch. &gt;!Thoughts?!&lt;\r\n* A reddit user introduced me to his company, Maestrix.ai, which turned out to be AWESOME. It created a comprehensive marketing framework for MYNDER in seconds, along with a social media content plan. It had my wheels turning about future content, particularly having it connect with specific pain points for my target customer (which it listed). Thanks for sharing!\r\n\n**Tomorrow To-Do**\r\n\n* Play around with MailChimp for email campaign\r\n* Review keyword list received from Fiverr gig.  \r\n* Begin Micro-blogger list\r\n\n&amp;#8203;\n\n    Subscribers:\r\nEmail: 33 (+3 more than yesterday!) \r\n\r\nYouTube: 5 (with 34 views 😊)\r\n\r\nInstagram: 25 (359 accounts reached!)\r\n\n\n&amp;#x200B;",
    "author_name": "MindingMomma",
    "author_profile_link": "https://www.reddit.com/user/MindingMomma",
    "post_url": "https://www.reddit.com/r/startups/comments/1cuhy0s/day_4_of_creating_prelaunch_hype_so_my_startup/",
    "subreddit": "startups",
    "keyword_matched": "pre-launch",
    "scraped_at": "2026-02-18T00:43:21Z"
  },
  {
    "content": "Day 7 of Creating Pre-Launch Hype so My Startup Reaches 10k Users\n**Content Creation:**\r\n\n* So my content TANKED. Like no engagement, little views. It was bad. \n* I changed my strategy to use more of the hip \"hooks\" and upbeat sounds. It went...GREAT. Apparently commercial/informational ads is not the way to go anymore. It's all about catchy/engaging content. I am modifying my content strategy accordingly.\n* I created a list of blog ideas to post about. Of course I plan to use AI to help me write, but I'll be adding my own personal flair. I'll be using Google's Blogger for this (it's free!)\r\n\n**Website**\r  \n\r\n\n* I made a draft of what I want my website to look like. Now I'm working to have it built or build it myself. My current website uses WordPress, so I think I'm limited to that (not sure). \n* I had to really think about what I wanted in the website. It's hard because my app hasn't launched yet, and I'm not ready to share screens. \n\n**Micro-bloggers**\r\n\n* I started my list of micro-bloggers (in excel). I'm going to start following them this week to show support. \n* I need to think of a my intro message. It has to be just right. \r\n\n**Insights**\n\n* In a moment of desperation, I engaged in the social media \"Let's Grow\" trend. This is when you comment on the \"Let's Grow\" post and you follow whoever likes it and they are supposed to follow you back. Except...they didn't. So I ended up confusing the algorithm into thinking my company catered to the Indian market (bc the folks I was following). Everything Insta was showing me was Indian. Had a great time trying to undo that mess. \n* Apparently the trademark applications are taking closer to a year rather than 8-9 months. \n\n&amp;#8203;\n\n    Subscribers:\r\nEmail: 37\nYouTube: 6\nInsta: 48 (645 accounts reached!)",
    "author_name": "MindingMomma",
    "author_profile_link": "https://www.reddit.com/user/MindingMomma",
    "post_url": "https://www.reddit.com/r/startups/comments/1cwquvu/day_7_of_creating_prelaunch_hype_so_my_startup/",
    "subreddit": "startups",
    "keyword_matched": "pre-launch",
    "scraped_at": "2026-02-18T00:43:21Z"
  },
  {
    "content": "On my 4th startup, raised money for the first time at a $10m valuation (i will not promote)\nI’ve been founding startups since 2020 and we were never able to raise money until something changed.\n\nEach time before this, I was CTO or something similar. Never in charge of fundraising conversations or the operational side of things, and I always felt like we could go faster.\n\nMy previous co-founders were typically “ideas” kind of people, some even good at sales but they were never able to raise. We always got response like “you’re too early”; even from pre-seed funds!\n\nI decided to jump back into the game after a short stint as a full time infra / ml-engineer (worked my way up to engineering director just before I left my last gig). I was going to be CTO again, and my co-founder was going to be CEO as he had a degree in business and entrepreneurship. \n\nExcept he wasn’t ready. He’s an amazing founder, but when we started in 2023 he just didn’t have the experience under his belt for us to go as fast as we needed to. \n\nSo I decided to take up the mantle of CEO. I was scared at first but grew in to the role. My first order of business? Buy books on storytelling. I read everything under the sun about how to convey a compelling narratives and draw people into our vision.\n\nI had also learned a few hard fought lessons along the way about how to fundraise. Validate demand for your product first, you only need a few prospective / signed customers. Then build. Build it yourself, the founders should be able to design, build and sell the full product.\n\nThen, don’t go to VCs. Especially european VCs before series A, they will just waste your time; not their fault, it’s just a culture thing.\n\nGo to angels first, then C tier VCs (ideally in the USA) and work your way up from there.\n\nWe eventually raised from some CEOs of billion dollar financial platforms, built the core team with a couple engineers and are currently hustling our way to series A.\n\nMost importantly, be super excited about what you’re building, it will come across in every conversation you have. \n\nNow, we’re building a platform for multi-agent infrastructure that lets businesses hire AI agents and connect them into teams just like you would with employees. Signed our first customer at $9k ARR and another coming onboard soon for $30k ARR. \n\nEven though it’s a platform play, we niched down super hard into logistics, specifically freight brokers and 3PL providers in the USA.  We built and sold the first agent on our platform that fully automates their Accounts Payable &amp; Receivable workflows. \n\nThe agent really works for any company, but it was way easier to craft positioning and messaging that resonates with a specific segment than something broad. Another key lesson, start small and grow your market in concentric circles.\n\nSoon we’ll launch our API / hosting product which will let solo builders and automation agencies build and host agents on the platform for businesses to hire; which we’re suuuper e",
    "author_name": "Icy_Recognition_9399",
    "author_profile_link": "https://www.reddit.com/user/Icy_Recognition_9399",
    "post_url": "https://www.reddit.com/r/startups/comments/1muqfbw/on_my_4th_startup_raised_money_for_the_first_time/",
    "subreddit": "startups",
    "keyword_matched": "pre-launch",
    "scraped_at": "2026-02-18T00:43:21Z"
  },
  {
    "content": "Day 5 of Creating Pre-Launch Hype so My Startup Reaches 10k Users\n**What got done today:**\r\n\n**Content Creation:**\n\n* Yesterday's post did not do very well. I think I need to rethink my strategy for what content I create. The stuff I had planned to do is \"cute and informational\". I think I need to go more with attention-grabbing and relatable. \n* I still posted the reel I had made for today, but plan to redo future content. I will focus on the pain points of each of my target groups. \n\n**Operations**\n\n* During testing, we found that one of my screens isn't optimally designed for certain scenarios. I have to resolve this asap so I won't fall behind launch schedule. \n* The privacy policy and terms of service are finally done. It took longer than expected given the industry my company is in, but I rather do it right than rush it. \n\n**Micro-bloggers**  \n\n* Started compiling a list of the 100 microbloggers I will reach out to. Then I realized there are THOUSANDS - in just ONE of the platforms (instagram). I think I have to rethink my strategy and broaden my search. Perhaps do 100 from Insta, 100 from YouTube, and 50 podcasters instead of just 100 total. My gut is telling me to focus on YouTube first since I haven't had much luck with the platform. \n\n**Tomorrow To-Do**\n\n* Think some more about the Micro-blogger list\n* Decide what to do about the website. \n* Think about future content strategy\n\n&amp;#8203;\n\n    Subscribers:\n    Email:33 (no change)\r\nYoutube: 5 (37 views)\r\nInsta: 26 (+1 follower)\n\n\r  \n**Question for the group:** How did you all get your website done? Fiverr/Upwork? Website company? Self-developed? What would be the best route?",
    "author_name": "MindingMomma",
    "author_profile_link": "https://www.reddit.com/user/MindingMomma",
    "post_url": "https://www.reddit.com/r/startups/comments/1cvar3x/day_5_of_creating_prelaunch_hype_so_my_startup/",
    "subreddit": "startups",
    "keyword_matched": "pre-launch",
    "scraped_at": "2026-02-18T00:43:21Z"
  },
  {
    "content": "Day 3 of Creating Pre-Launch Hype so My Startup Reaches 10k Users\n**What got done today:**  \n**Content Creation:**\n\n* I posted my first reel on Insta/Facebook!  - It was quite the rollercoaster of emotions and anxiety. Although it was a success, it was far from smooth.\n   * First, I realized that I cannot use my YouTube video because reels come in a different size and it looked very choppy. So I scrambled and changed the formatting in Canva. It. Was. Not. Fun.\n   * When I finally got it ready and figured out how to post the reel, I posted it to FB and Insta only to realize I forgot to add the hashtags. I was able to update the caption in one platform, but for the other I had to delete the video and repost.\n   * Overall there was good reception to my brand launch and I saw family and friends repost the video.\n* I worked on my reel for tomorrow, which is a short reel (about 15 secs). I went back and forth about creating a longer and comprehensive video, but sided to maintain my plan to alternate between long, short, long, short…\n\n**Website**\n\n* FB Link: Still no update on the broken Facebook link on the website. I followed up on Fiverr.\n* Email Campaign: the good news is that MailChimp offers free emails under the free version. The bad news is that there is no automation. I looked into other providers but they seem to have a pay wall as well. I figured that I’ll use MailChimp for now until my email list gets bigger. I'll send out a weekly email.\n   * I started working on a template. I will include a feature of the week, a survey, and perhaps one of our social media posts. What else should I include?\n\n**Insights:**\n\n* On a podcast about growing one’s business, the presenter suggested that I reach out to “micro-bloggers” for two purposes: 1) product review that could be shared in their channel or 2) a formal business partnership.\n   * It got me thinking about the review route. If I reach out to 100 micro-bloggers/influencers to introduce them to MYNDER and if on average these folks spread awareness to just 10 people, then I’ll reach 10% of my goal. I will be thinking more about this plan.\n* I saw a post on Reddit about Product Hunt. The post questioned the usefulness of Product Hunt, which has me rethinking this platform. I had created a campaign there but didn’t formally “Submit”. I need to do research on the ROI on this.\n   * Does anyone have experience with PH?\n\n**Tomorrow To-Do**\n\n* Share promo video on insta\n* Play around with MailChimp for email campaign\n* Review keyword list received from Fiverr gig.\n\n\n\n    Subscribers\n    Email: 30 \n    YouTube: 2 (but 26 views 😊) \n    Instagram: 14",
    "author_name": "MindingMomma",
    "author_profile_link": "https://www.reddit.com/user/MindingMomma",
    "post_url": "https://www.reddit.com/r/startups/comments/1ctq6nw/day_3_of_creating_prelaunch_hype_so_my_startup/",
    "subreddit": "startups",
    "keyword_matched": "pre-launch",
    "scraped_at": "2026-02-18T00:43:21Z"
  },
  {
    "content": "Made a pre-launch landing page\nHello all,\nI recently began my startup journey and for reference I’m completely new to the startup scene. I recently made a pre-launch landing page to gather leads and gauge market interest in the product, however the domain name I wanted, ending in .com is currently selling for just under 3K.\n\nMy question is if I have a different domain ending (say .co or .info) just for the landing page, will that hurt my ability to gather leads? Should I host on a free platform just bc it’s the pre-launch landing page? \n\nKind of lost/unsure of what to do next as I don’t have 3K to blow on a domain.\n\nAny advice is much appreciated",
    "author_name": "Square_Helicopter_67",
    "author_profile_link": "https://www.reddit.com/user/Square_Helicopter_67",
    "post_url": "https://www.reddit.com/r/startups/comments/1c7j7kq/made_a_prelaunch_landing_page/",
    "subreddit": "startups",
    "keyword_matched": "pre-launch",
    "scraped_at": "2026-02-18T00:43:21Z"
  }
]